gillwei7/QAR87_NXP_RT685_main/BT_Audio/evkmimxrt685_a2dp_sink_cm33/source/pin_mux.h
/*! @name FLEXSPI0A_DATA1 (coord C7), J32[1]/SD_DAT3
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT3_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT3_SIGNAL FLEXSPI_A_DATA1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT3_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT3_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT3_PIN_MASK (1U << 21U)
/* @} */

/*! @name FLEXSPI0A_DATA2 (coord B5), J32[7]/SD_DAT0
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT0_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT0_SIGNAL FLEXSPI_A_DATA2
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT0_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT0_PIN 22U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT0_PIN_MASK (1U << 22U)
/* @} */

/*! @name FLEXSPI0A_DATA3 (coord A5), J32[11]/CARD_WR_PRT/SD_WR_PRT
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_WR_PRT_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_WR_PRT_SIGNAL FLEXSPI_A_DATA3
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_WR_PRT_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_WR_PRT_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_WR_PRT_PIN_MASK (1U << 23U)
/* @} */

/*! @name FLEXSPI0A_SCLK (coord B7), J32[5]/SD_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_CLK_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_CLK_SIGNAL FLEXSPI_A_SCLK     /*!<@brief Signal name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_CLK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_CLK_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_CLK_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0A_SS0_N (coord B4), J32[9]/SD_DAT2
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT2_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT2_SIGNAL FLEXSPI_A_SS0_B
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT2_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT2_PIN 19U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEVFLEXSPIFLASHPINS_SD_DAT2_PIN_MASK (1U << 19U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDevFlexSPIFlashPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDevButtonsPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name I3C0_SCL (coord C11), J18[1]/U8[2]/U17[A6]/SCL_CODEC
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEVI3CPINS_I3C0_SCL_PERIPHERAL I3C
/*!
 * @brief Signal name */
#define BOARD_INITDEVI3CPINS_I3C0_SCL_SIGNAL SCL
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEVI3CPINS_I3C0_SCL_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEVI3CPINS_I3C0_SCL_PIN 29U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEVI3CPINS_I3C0_SCL_PIN_MASK (1U << 29U)
/* @} */

/*! @name I3C0_SDA (coord C9), J18[2]/U8[3]/U17[B6]/SDA_CODEC
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEVI3CPINS_I3C0_SDA_PERIPHERAL I3C
/*!
 * @brief Signal name */
#define BOARD_INITDEVI3CPINS_I3C0_SDA_SIGNAL SDA
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEVI3CPINS_I3C0_SDA_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEVI3CPINS_I3C0_SDA_PIN 30U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEVI3CPINS_I3C0_SDA_PIN_MASK (1U << 30U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDevI3CPins(void); /* Function assigned for the Cortex-M33 */

